{
    "reviews": [
        {
            "id": "6505",
            "author": "dUn1x6vYjFTdGjFO4avFwmwUzPf2",
            "course": "CSE-6242",
            "created": 1533481861011,
            "difficulty": 2,
            "extraCredit": "",
            "firstCourse": true,
            "frontLoad": true,
            "groupProjects": "",
            "moneySpent": "",
            "previousClasses": 6,
            "proctortrack": "",
            "program": 1,
            "projects": 2,
            "rating": 4,
            "semester": "2018-2",
            "tests": 2,
            "text": "Good class as a summer class because you can work ahead on most of the homeworks and projects.  It serves as a good introduction to data analysis as you learn R.",
            "updated": 1533481861011,
            "workload": 8
        },
        {
            "id": "-K2QDGcJfyyg5eiByfMR",
            "author": "google:115398662116989618541",
            "course": "CS-6300",
            "created": 1446786964000,
            "difficulty": 2,
            "rating": 5,
            "semester": "2015-1",
            "text": "This was one of the first courses I took, and I am glad that was the case. It was a comfortable way to get started. I also enjoyed learning how to develop an Android app. ",
            "updated": 1459894289000,
            "workload": 5
        },
        {
            "id": "-K3B0wpgLgZ1-X7ATVuC",
            "author": "google:115398662116989618541",
            "course": "CS-6505",
            "created": 1447605816000,
            "difficulty": 5,
            "rating": 1,
            "semester": "2015-1",
            "text": "If you do not have a discrete mathematics background, this class will be very challenging. \n\nHomework assignments take the full amount of time allocated to complete, and even that may not feel sufficient. \n\nThe rare programming assignments require Python/Numpy knowledge. The exams ended up with >50+ curves, which should be telling, since they are clearly too difficult or the teaching leading up to them is inadequate.",
            "updated": 1487452997000,
            "workload": 20
        },
        {
            "id": "-K3QbY3WczPdeGng4Ubz",
            "author": "google:101531499641196700998",
            "course": "CSE-6220",
            "created": 1447867339000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-3",
            "text": "Interesting lectures, great instructor. Challenging Lab assignments (there are 5 total). Need to know C/C++ programming. Not a lot of TA handholding. Facinating topics. ",
            "updated": 1466217789000,
            "workload": 18
        },
        {
            "id": "-K4knimBGqR0wAMp0ZwA",
            "author": "7a83c83e-b098-4169-9aea-d20c0b151c37",
            "course": "CS-6035",
            "created": 1449296587000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2015-3",
            "text": "This has been an interesting course because I've had an interest in security. Hopefully in the future, they reduce the weighting of the midterm/final exams, emphasize the projects, and break the projects apart a little more. Unfortunately, the quizzes and exams are essentially rote memory tests. I watched the lectures, but found the book more informative and that's what the quizzes were largely based upon. The projects were the best part pedagogically. ",
            "updated": 1471232847000,
            "workload": 3
        },
        {
            "id": "-K4wvi6ZLisfIOq7ipGQ",
            "author": "google:115398662116989618541",
            "course": "CS-6200",
            "created": 1449500009000,
            "difficulty": 4,
            "rating": 1,
            "semester": "2015-3",
            "text": "25% Midterm Exam\n30% Final Exam\n10% Project 1: Multi-Threaded Webserver\n10% Project 2: Experimental Analysis\n10% Project 3: Inter-Process Communication\n10% Project 4: Remote Procedure Calls\n5% Class Participation\n\nProjects require comfort in C and the ability to hand-code many things for which open-source libraries exist. \n\nUdacity auto-grader is frustrating at best. So often, folks would succeed with their implementation in the VM just to discover the auto-grader would fail. This made debugging nearly impossible and extremely frustrating, as the specific test cases exercised in the auto-grader are not revealed. \n\nLectures are lengthy and detailed. Anything is fair game, so volume is high. Still, the instructor's style is excellent. She explains topics clearly and concisely. At times, the real-world examples feel incomplete. \n\nWhile I was exposed to a ton of material, I felt I could have self-taught that material. The projects leave something to be desired. ",
            "updated": 1459899569000,
            "workload": 25
        },
        {
            "id": "-K4x-TUxEPX5bInobzqN",
            "author": "google:115398662116989618541",
            "course": "CS-6310",
            "created": 1449501255000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-3",
            "text": "50% Projects\n20% Assignments\n20% Exam\n10% Class Participation\n\nThe four projects build on one another to ultimately produce an app that uses a linear programming engine (Gurobi) to make course-enrollment recommendations given student/admin input. \n\nThe assignments require writing a document covering a particular topic. I thought pursuing CS would be an end to writing essays, but I was wrong. \n\nThe final is open-book, take-home. As long as you've watched and internalized the lectures, it's straightforward. ",
            "updated": 1459899440000,
            "workload": 10
        },
        {
            "id": "-K4x1SVIxk6sOSqiWBsU",
            "author": "google:115398662116989618541",
            "course": "CS-6440",
            "created": 1449501775000,
            "difficulty": 1,
            "rating": 3,
            "semester": "2015-3",
            "text": "30% Quizzes\n20% Activities\n50% Project\n\nThe course is about a group project that delivers an app built on top of healthcare data accessible through RESTful FHIR APIs. Make sure to pick your group members carefully instead of randomly. With the right group members, your experience will be positive. With the wrong group members... well, you get the idea. \n\nThe quizzes and activities are open-book. Each multiple-choice/multiple-select quiz tests material from two lectures (10 lectures total). The two activities test your ability to interact with RESTful FHIR APIs and the FHIR data model. If you have any database experience or can think logically, they are a breeze.",
            "updated": 1507677091000,
            "workload": 5
        },
        {
            "id": "-K51NhGsCLJaXVhGjruq",
            "author": "7720a2dd-ec5e-4403-9cc1-60f4072a3b39",
            "course": "CS-6290",
            "created": 1449591493000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-3",
            "text": "Amazing course! Excellent video lectures. Haven't learnt so much in a long time. Prof. Prvulovic's explanations left very little doubt on almost all the topics he covered in the lectures. I have them all downloaded & can keep going back for reference. Although a more active participation on piazza would have made the learning experience even better. But, having gone to a college here in the US for my masters' I know it's almost not possible to get full attention of a Prof all the time... \nPerhaps some homework assignments would have helped improve the understanding even better (& helped in the midterms :)). The projects were interesting and were useful in applying what we learn in the classes. There were lot of complaints about the SESC simulator code in general. Its very understandable that the code is in that state having changed so many hands. Don't have much to complaint about this course in general. \nOverall experience with the course has been very satisfying.",
            "updated": 1481433009000,
            "workload": 12
        },
        {
            "id": "-K56psA-diGaOPfvSvzK",
            "author": "google:111858721800469170401",
            "course": "CS-6290",
            "created": 1449683026000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-3",
            "text": "The Pros -- Course material is great - videos are interesting, funny, and full of content. Minor supplemental reading helped flesh out some of the more challenging topics. Learned a tremendous amount in a quick time. \n\nThe Cons -- the embedded quizzes have frustrating errors at times (typos, looking for specific formats of values, accept only an incorrect answer). Some videos appear missing or incorrectly ordered. \n\nThe Major issue -- Piazza interaction with the professor & TAs was very limited. Office hours were cancelled for a few weeks, then disappeared altogether. Logistics around projects and exams were poorly communicated. \n\nOverall -- great content, but be prepared to learn it with you and your fellow students. Very limited ad hoc teaching support. ",
            "updated": 1462290993000,
            "workload": 15
        },
        {
            "id": "-K5FsAibpJr488zaVxfr",
            "author": "47cfc7ba-791c-40fa-8e32-53c64eac3970",
            "course": "CS-6210",
            "created": 1449834626000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2015-3",
            "text": "I took IOS in Spring 2015, AOS in Fall 2015. IOS was a good basis when you're not already familiar with C and systems programming. \nEvery lecture walks students through a single paper, explaining the concepts and adding historical, academical context. The selection of papers is very good, it's a journey through landmark ideas in systems research. Reading all the papers was impossible for me with a day job and hobbies. I resorted to reading the abstract and summaries (provided by peres as part of course requirements) for about three quarters of the material. \nThe grading of projects and exams seems fair and forgiving. \nThe projects are tough and require recognizing challenges and coming up with your own designs for them. Also you have to write your own test code, which can be a substantial part of the project. It is always recommended to start working on the project 2-3 weeks in advance to be able to ask questions on Piazza and also just to sleep over it and find solutions to problems. They are definitely not \"just doing the exercise\". \nThe course requires a bit of investment, but offers tremendous learning opportunity. I was also constantly drifting off into the subjects covered while browsing through Wikipedia, research papers and technical manuals. ",
            "updated": 1459930721000,
            "workload": 12
        },
        {
            "id": "-K5FxAiGYdKJZ4BjIkBY",
            "author": "47cfc7ba-791c-40fa-8e32-53c64eac3970",
            "course": "CS-7637",
            "created": 1449835936000,
            "difficulty": 3,
            "rating": 2,
            "semester": "2015-2",
            "text": "The lectures were thought by Dr. Goel, but the primary instructor was David Joyner. These notes are copy & pasted from the Piazza forum of the course. \n\nI did not like this course very much. Disliked the flow of the lectures, had a hard time following what Dr. Goel tried to explain and could not relate lecture content to the projects really. Has been the most frustrating class so far in my curriculum. I really liked the organization and effort that went into the interactive exercises, the overall communication, grading and the friendly frequent contact. David's been a great instructor. \n\nThe whole educational strategy of this course is brilliant. I would love seeing it applied to other courses. \n\nI can appreciate how the KBAI class falls into the \"academic-style thought\" bucket. I admit, I might have approached the class from a wrong angle, even though it said so right on the labelling. \n\nBut then I doubt the validity of your airplane analogy. Of course the airplane project would not touch upon every subject, but conversely the lectures should instruct how to actually design such a plane. Or at least point to the right resources, tutorials or books. I just thought it would not hurt to slide in a lecture or two that examines the design and implementation of a couple of cool and interesting classic or modern AI agents (maybe a simple one right in the first week to illustrate what we're talking about, a more complex one in the middle and an advanced one at the end). I would argue it would strengthen the understanding of the high level concepts being thought. ",
            "updated": 1459930698000,
            "workload": 7
        },
        {
            "id": "-K5Wd1jIOW9u_3TEQyJ1",
            "author": "google:117773455411413753598",
            "course": "CS-6200",
            "created": 1450115869000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-3",
            "text": "This was my first class in the OMSCS program and by far this was the best class I have taken during my formal CS education. I did get an A in the course for some perspective. The course is made up of 4 projects, a midterm, final, and class participation on Piazza. The lectures are great and easy to follow. I highly recommend watching them on at least 1. 25x speed. I started doing this halfway through the semester (eventually bumped up to 1. 5x when re-watching) and realized I could retain a lot more info than having to keep rewinding because my mind was drifting. Only a handful of papers to read, most were pretty dated but helped drive some concepts home. If you are looking for an easy class though, this is not for you. I feel this has prepared me well for the workload/work ethic necessary to succeed in classes to come. You get out what you put in!\n\nAlso 'Operating Systems: Three Easy Pieces' is a free online book that I referenced A LOT to give me an intro into the topics discussed in the lectures. Chapters are short and easy to read/comprehend. Highly recommend it!\n\nFull Details:\nThe projects are, as mentioned everywhere else, difficult and clarification of parts are necessary. I would recommend being comfortable with at least the basics of C (pointers, func pointers, extern usage, getopts, string parsing, file manipulation, etc. ). For some that might be too basic but if you know how to read through the provided code then you should be okay to at least get through the simpler portions of the projects. You will want to start looking into the basics of socket communication, posix threading library, posix/sysv IPC mechanisms and synchronization. You will be provided enough material to get you going with each of the items listed in the last sentence. \n\nThe midterm and final are not easy and it is not enough to \"memorize\" formulas/concepts. You will need to understand the purpose and how each input to the problems/equations affect the output and then formulate what pieces are necessary to come to the correct answer. You will really have to understand the material. That said it is possible to do well. Participating in Piazza discussions, re-watching lectures, and doing the projects will prepare you well in understanding the concepts/problems on the exam. \n\nOne thing you might not expect is that you are provided an Ubuntu VM that is set up to test your projects in before trying the auto-grader in Udacity. Valgrind and GDB will be your best friend and help you find things that the auto-grader will detect and fail your submission even though things in the VM work fine. I would recommend some sort of version control too (I used git)!",
            "updated": 1461855868000,
            "workload": 20
        },
        {
            "id": "-K5cCLCNr4YgLI7ErlQe",
            "author": "google:112945305712540820048",
            "course": "CS-6476",
            "created": 1450226049000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-3",
            "text": "Course lectures and projects were very entertaining and challenging. Projects are well defined. I suggest brushing up on linear algebra while taking the course as the later lectures are heavy in this area. Also be sure to comment and help in the forums, because participation actually matters. I lost 2% of my overall grade because I only made 70 comments in the forums -- the top student commented hundreds of times. The final was not super challenging and was a good reprieve from the rigor of the projects.",
            "updated": 1477348625000,
            "workload": 30
        },
        {
            "id": "-K6dZgmIq-KoFmJZI4T_",
            "author": "google:106105612010868281072",
            "course": "CS-7641",
            "created": 1451322690000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2015-3",
            "text": "The content isn't too difficult. The lectures go into more math than you need for the tests and projects, but it's good to understand. My favorite lectures so far in this program (edit: CV, which I took later, ties or is better for lectures). \n\nThere are 4 projects that take a ton of time. Each project is open to how you want to implement it and with what libraries you like. Every time I spent several hours writing code before I could even begin the results papers, and then much more time running tests and rewriting code once I started and understood what each paper really required. It was stressful knowing another paper was due just another 3 or 4 weeks away and I had to begin immediately. Do begin immediately. \n\nAs my first introduction to machine learning algorithms I learned a so much in one semester and the class was very worthwhile. I loved this course.",
            "updated": 1480286608000,
            "workload": 15
        },
        {
            "id": "-K6da2o4AdaF-8mzcVP0",
            "author": "google:106105612010868281072",
            "course": "CS-6300",
            "created": 1451323047000,
            "difficulty": 1,
            "rating": 3,
            "semester": "2015-3",
            "text": "If you've already worked as a software developer you should avoid this course. It's some very simple development ideas and introduction to git and android. A team project makes a simple app. \n\nOr take it along with a tough course to pad your schedule. ",
            "updated": 1462480812000,
            "workload": 3
        },
        {
            "id": "-KARuNmU1XoPBBZ9MAd-",
            "author": "google:114673802074090621615",
            "course": "CS-6250",
            "created": 1455405184000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2015-3",
            "text": "I loved this class. It's challenging and you learn a ton, but it's not frustrating the way some other classes can be. The lectures were fabulous and the projects did a great job teaching me Mininet and helping me get my Python skills up to par. Overall, a great first class for someone who has been out of college for a while. ",
            "updated": 1463017631000,
            "workload": 8
        },
        {
            "id": "-KARwkHeGnubrNROoW5N",
            "author": "google:114673802074090621615",
            "course": "CS-6300",
            "created": 1455405804000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2015-3",
            "text": "This class really measures your writing and Java programming skills. If you don't have experience with Java and JUnit, this class will be very time consuming. The material is not difficult, but project are a challenge (especially if you're placed on a team with weak Java skills). The written documentation you need to write is extensive, but not challenging. ",
            "updated": 1463017619000,
            "workload": 15
        },
        {
            "id": "-KB0PNgtqGoWQBTq9_ta",
            "author": "google:108238702059160567897",
            "course": "CS-6035",
            "created": 1456017633000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2016-1",
            "text": "Seems like peoples concerns were heard. Spring 2016 syllabus has (20) 1% quizzes, (4) 15% projects, (2) 10% exams, and (1) optional 10% project for a grade boost. First project took a bit of time to learn about how to use gdb and machine code in general. Preparing for midterm now, which coveres 10 chapters. \nThe second project was a bit annoying to get the VM set up. I was sure I ran the malware analysis correctly, but don't think the results were coming out correctly. I got a new laptop after this project to ensure that I would not have any technical issues for the remainder of my OMSCS life. Project 4 and optional project 4. 5 were easy because I am familiar with JS and SQL. Project 3 was buggy, and the instructor recognized that stating that he will address that in future courses. \nI missed a bunch of quizzes because of poor time management, but still ended up with an A in the course. Overall the class touches upon many interesting topics and is a good second course to take with something more intense, such as ML. ",
            "updated": 1462847789000,
            "workload": 10
        },
        {
            "id": "-KBOA5Vkw1MdgkJgFFuu",
            "author": "e98be4c9-5e97-45c0-ba44-8f216d0bd495",
            "course": "CS-7641",
            "created": 1456416254000,
            "difficulty": 5,
            "rating": 2,
            "semester": "2016-1",
            "text": "I have a different opinion of this class. It is often stated that people who struggle in this class suffer from inexperience. However, I am a senior level data scientist in the industry who has taught courses and authored packages on machine learning. In spite of that, the workload was high, and I felt the grading was arbitrary if not vicious. There is some talk that all of this will be corrected in the end with large scale curving, but that is a poor system. I ended up dropping this class, and I do not recommend it. The lectures are good, but those are free to watch at any time. ",
            "updated": 1470233342000,
            "workload": 20
        },
        {
            "id": "-KCO6Nrc49cxyuyeupuu",
            "author": "989f5df8-3f3b-4529-9e16-35a97a6289db",
            "course": "CS-7641",
            "created": 1457489030000,
            "difficulty": 5,
            "rating": 2,
            "semester": "2015-1",
            "text": "This class tests your ability to work with libraries and hunt down data & process. It is very poor at teaching you Machine Learning efficiently compared to the numerous other offerings on Coursera. \n\nDon't expect to understand the material presented. That apparently isn't the goal of the course because the instructors spend their time hand-waving and the assignments have you spend time debugging against shoddy tools. You won't learn to troubleshoot the thought process or algorithms, just to fiddle at the margins with the tools provided. The people who give this course favorable reviews are very strong coders but very weak on theory and math; they pull through because they can plug & chug the coding assignments and use the crappy tools. Based on other reviews, many students thought the math in this course was challenging. It is basic freshman/sophomore calculus, but a lot of people didn't come into this program with that. If you consider yourself a math person, take Andrew Ng's classes on Stanford Engineering Everywhere. That's what real Machine Learning looks like, not the plug-and-chug coding of this course. \n\nIn this course you will get a lot of practice running algorithms that are poorly explained. I have a math / physics background and am floored by how superficial -- yet still time-consuming -- the total coverage, problem sets, and exams were. The questions involve running algorithms and interpreting output, which is about as crank-turning as I could imagine. Still, it takes a lot of time to do because the tools (except Weka) are weak and the lectures exceedingly hand-wavy. I found the book much more clear (though dry) in its explanations than the lectures. Neither were helpful on any of the assignments. Basically if you're modestly good at Java (or expertly good with Python and R ML libraries) and have a lot of time to learn to use APIs for existing ML tools, then you're fine. Perhaps that's what all CS courses are like?",
            "updated": 1462933791000,
            "workload": 30
        },
        {
            "id": "-KCnlFBwgXMSFWmm7TNg",
            "author": "3c39ef91-4f6f-4acc-b037-1adbfa15ea73",
            "course": "CS-7641",
            "created": 1457936202000,
            "difficulty": 3,
            "rating": 2,
            "semester": "2016-1",
            "text": "I dropped the first time, I'm doing well this time. \n\nThe first time I understood very little because I had little knowledge of the subject. Since then, I've learned from various sources. Now when I read the book I actually understand. My best advice is to find classes in Coursera, in OMSCS, etc to give you background: because this class doesn't. \n\nLectures: VERY GOOD explain concepts quite clearly (see caveat above)\nProfs: FUN, participative, great. \nTAs: some are very helpful (esp. Elijah)\nAssignments: VERY POORLY designed. \n\nTip: Pyhton, ABAGAIL\nOnce past the smoke screen of indecision and tool barriers. The assignments are actually just a lot of busy work. You are also expected to dominate things not taught (ROC, precision vs recall... ). No methodology taught in detail in spite of this being the emphasis. \n\nMy best advice? If your specialty allows it, skip this class. Watch the videos for free on Udacity and learn ML elsewhere. The assignments are just wasteful of your time. ",
            "updated": 1461204519000,
            "workload": 20
        },
        {
            "id": "-KCsEotHArsAiJJ4zFs6",
            "author": "a122e8b0-fae5-48a4-9207-ebb61d88efa9",
            "course": "CS-6601",
            "created": 1458011353000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2016-1",
            "text": "Along with ML this has been one of my favourite classes. The TAs and Professor are extremely helpful, the material is difficult, but not overwhelmingly so (there is some expectation that you will seek external resources or spend a lot of time reading the textbook, as lectures videos by themselves are probably too shallow to complete assignments). I felt the midsem was fair assessment of your knowledge. \n\nAs for the assignment, there is a level of satisfaction with \"getting to the end\". This doesn't mean that I'll score 100%, but merely finishing is an achievement in itself. Others in Piazza have noted that the marks gained in each segment of the assignments are not weighed with the amount of time used solving them - I believe this is correct and to be honest I'm totally fine with that. \n\nI think anyone taking this course will learn alot and is well worthwhile. \n\nTop tips:\n\n* Review AI topics beforehand (use google to find the syllabus)\n* Knowledge of Numpy/Python would help\n* Taking ML first would naturally make the ML portions easier... \n\nI don't think there's really any course that I would say should be done as a prerequisite for the AI course, and would work fine as a first course. ",
            "updated": 1462817967000,
            "workload": 15
        },
        {
            "id": "-KCt2CrPwUwQokWNraxq",
            "author": "google:100542095025772670385",
            "course": "CS-8803-001",
            "created": 1458024752000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2016-1",
            "text": "The dedication of the TAs is impressive. They prepare introductory videos every week, always share materials related to the course, and are quick to respond to questions. The course is very manageable as all materials are in Udacity and are available right from the start. The video lectures are very easy to follow, however I feel that I need to do some work outside from what the course requires for the knowledge to be ingrained. \n\n(Update)\nSomeone asked if you get to learn more advanced techniques in AI4R... \nI am a total noob, so everything is advanced to me... I guess it is how you make of it. The course gives you many opportunities to learn more advanced techniques, but you can complete the course satisfactorily (I guess) without doing so. \n Throughout the lectures and the problem sets, it feels like you are being assisted like a 5 year-old: everything is well explained, you wouldn't notice much if you do not have a good grip. The problem sets are scored as all or nothing, but the answers are also provided so it seems to be just a matter of having tried or not tried. If you want to get more advanced, materials for advanced study are also provided, but it would not really hurt if you do not glance over them. It is easy to get complacent, until you get to the Runaway Robot and the Final Project, which are really challenging. You really needed to take a big leap, read a lot more and explore other possible algorithms to solve the problem. Most of my classmates talk about using an algorithm not even discussed in the lectures for solving the Final Project. \n\n The TAs are very helpful. They do their best to up the participation, even create interesting videos every week. When somebody asks questions, they are quick to dive in. And when they do, they do not just answer: they give expounded explanations like how things might be different for other cases. But this course can actually be done even without interaction with others, so Piazza is sort of quiet. ",
            "updated": 1460944465000,
            "workload": 5
        },
        {
            "id": "-KD2A4HBGz4g7uSmBtfV",
            "author": "dda7acf2-e878-43aa-9975-3cbe35aa42e8",
            "course": "CS-8803-004",
            "created": 1458194634000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2016-1",
            "text": "The project and homework workloads have been pretty much alike. In both cases, the assignment descriptions have been vague and piazza has been a great help. \nThe video material is nice and concise. \nWe haven't had an exam as of March 17th 2016. \nThe first project was insanely ambitious and the next one sounds exciting. \nOverall I think it's been okay for a first run of the course. I'm having a good time. \n\n[Edit, May 11 2016]\nThe final exam showed great improvement from the project and assignments before it. It was, in fact a very well produced exam, which evaluated the student's knowledge and insight, rather than plain memory. \n\nOverall, I still think it was a good first run with an inevitable learning curve from the staff side. Next offering will no doubt be much better. \n\nAgain: A lot of compiler plumbing is present in this course... and not one ARM Cortex processor. ",
            "updated": 1463000991000,
            "workload": 24
        },
        {
            "id": "-KD2CVOgmEUXXzK6aHsd",
            "author": "dda7acf2-e878-43aa-9975-3cbe35aa42e8",
            "course": "CS-6460",
            "created": 1458195269000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2016-1",
            "text": "This is a class structured as a PhD, where there are no lectures and you decide how hard it will get. It's very possible to ace this class if you're motivated enough. \n\nSince you choose your own project or research, pretty much anybody can relate to a project that concerns Educational Technology. \n\nHere are some examples of projects: Music teaching tools, sign language SW, anti plagiarism tools, identity verification, group interaction tools, AI for pretty much anything, k12 and STEM involvement, safety and security, assessment tools, and the list goes on and on. ",
            "updated": 1463001001000,
            "workload": 10
        },
        {
            "id": "-KDE3ApZXqyYyYlP2Srl",
            "author": "47cfc7ba-791c-40fa-8e32-53c64eac3970",
            "course": "CS-6340",
            "created": 1458394152000,
            "difficulty": 3,
            "rating": 5,
            "semester": "2016-1",
            "text": "Excellent presentation, clear and concise lectures\nVery good overview over modern, academic approaches\nExpands thinking about testing and offers a glimpse into academic advances \nQuizzes in lectures really help understanding the content\nVery well paced, consistent amount of work every week\nGreat choice of topics, good little insights into previous and current research\nVery active professor and TAs\nGenerous grading curve",
            "updated": 1459930690000,
            "workload": 6
        },
        {
            "id": "-KDF9IX9T1DUUBfn05-Q",
            "author": "69a5cfc9-9708-4b14-bed3-d0a146898105",
            "course": "CSE-6250",
            "created": 1458412533000,
            "difficulty": 5,
            "rating": 1,
            "semester": "2016-1",
            "text": "The amount of work expected in this class is insane for a 3 credit class. When the professor designed the course, I doubt he realized how time-consuming it would actually be. \n\nIt took me 2-2. 5x as much time as Machine Learning (7641) did. As mentioned below, the time-spent-to-amount-learned ratio is not very good. I probably spent about 5% of the time actually learning and 95% of the time hacking away / throwing everything against the wall to get something to work. Many classmates had similar feelings. \n\nOne of the (4) homeworks took me about 12 hours just to get the very first part correct - worth 5 points; and that step was necessary to move on with the rest of the assignment. On another assignment I was stuck on the first section for an entire week and spent around 30 hours trying to figure out what was wrong. The students on Piazza and the TAs are helpful, but when you are truly stuck, too bad - you'll get a bad grade. What's worse is that the TAs don't share the correct solutions with you afterwards. Because of this, I feel like there's a lot I didn't take away from the class. \n\nThe class frequently has guest lecturers, which seem extremely interesting. Unfortunately, the instructors never shared any of the videos past March 1st, so the majority of talks were never shared with OMSCS students. Students asked about this on Piazza (several times) with no response from the teaching team. \n\nThe final project is enjoyable, but my mentor didn't make things easy. For the project, my mentor was supposed to upload a large. csv file to a Postgres database, but 2 days before the due date he still couldn't get it working -- which led to me having to re-write a significant portion of my code. I spent about 20 hours debugging this, but still couldn't get it working - because of that, I was forced to use a smaller dataset (which I'll be punished for). \n\nThis course has a lot of potential, but desperately needs to be re-designed and have the professor more actively involved. ",
            "updated": 1461383529000,
            "workload": 40
        },
        {
            "id": "-KDOgM8wB6dw6HBbB6QB",
            "author": "facebook:10154024030449518",
            "course": "CS-8803-001",
            "created": 1458572456000,
            "difficulty": 2,
            "rating": 5,
            "semester": "2015-3",
            "text": "Great course: great instructor, great TAs, great content and exciting assignments. My only minor concern was that I found the material a bit too short (you have lectures only every second week). Be sure to start to work on the final assignment early because it is harder than the rest of the course, I found myself running out of time while I still wasn't 100% finished with it. Also, brush up your python a bit to make things easier. The class is quite easy and a great companion course for Computer Vision or Computational Photography class if you can manage 2 classes a semester (I had a bit of prior knowledge in AI, computer vision and control theory, I found half of the course already familiar). ",
            "updated": 1467282534000,
            "workload": 6
        },
        {
            "id": "-KDOpPyzy8kOQyEpeGb_",
            "author": "facebook:10154024030449518",
            "course": "CS-6476",
            "created": 1458574831000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2015-3",
            "text": "This is a hard course without good Python, linear algebra and computer vision foundations (like the Computational Photography class) knowledge. The video lectures are interesting, funny and clear, they are truly great lectures. However, I found the TA-ing not to be involved enough or maybe the flow of information itself was not enough. \n\nThe workload is quite heavy, there were a few assignments I spent 20+ hours on (just the coding itself). Grading is okay, though the requirements are not always 100% clear. Also the workload distribution is not even so be sure to jump into the assignments very early on, especially the first few. Another downside of the heavy workload that the TAs can't always keep up the pace either, some assignments took quite long to return and we had to submit at least 3 assignments before we got our first feedback. All these result in a lot of noise on Piazza, you have to go through 10K+ posts on piazza during the semester if you want to keep up. \n\nThey dropped MATLAB Fall2015, from now on you can only do your homework in Python. And unless you are good at Python (including advanced things like optimization and parallelization in NumPy), you'll spend a few nights debugging for sneaky bugs or screaming over algorithms that run for 40 minutes. \n\nAll in all: it is a good class but there is a room for some improvement. The material is great, the assignments are hard but rewarding. ",
            "updated": 1467282667000,
            "workload": 20
        },
        {
            "id": "-KECMeo42OHf3YFc2BR_",
            "author": "google:114363924972812438647",
            "course": "CS-6340",
            "created": 1459439447000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2016-1",
            "text": "Overall the class covers some neat topics. Assignments are directly related to the lectures and utilizes the tools discussed in the lectures. In fact, some of what we've done I would like to see used in my job. \n\nAssignments aren't too difficult and aren't too time consuming. Some will require extra reading but overall they should only take a few hours to finish. Exams were difficult, in part due to the exam format. ProctorTrack did make some updates for the final but the format still was kind of wonky (making table with text is kind of hard, long questions were in a scrollable box so you had to keep scrolling back and forth to get the full picture). There wasn't anything in the exam that wasn't covered in the lectures, you just need to make sure you have a real understanding of the lecture material and really understand the solutions to the lecture quizzes. \n\nThere are some pacing problems, but that will likely be improved in future iterations of the course. Up to the midterm there's something to do every week, but after there's not much material left to cover. ",
            "updated": 1462902329000,
            "workload": 3
        },
        {
            "id": "-KEPT5Q66eN9sVaswgbj",
            "author": "545bb110-ef09-4395-8cb6-ba3a06a54900",
            "course": "CSE-6220",
            "created": 1459659236000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "There's a few easy, wishy washy courses in the OMSCS program. This is definitely not one of them. This is probably one of the best classes I've ever taken in my life. \n\nThis class is hard. If you are not a competent c programmer with an understanding of basic algorithms you will probably not make it through this class. However, this class is also completely awesome. The lectures are incredibly well done and are interspersed with actual good humor by Prof. Vudoc. The projects are all very interesting. There are 5 of them and I've spent about 20 hours on each. I could have spent double that time optimizing them, but my efforts were good enough to get close to 95% on most. \n\nThe midterm was brutally hard. I have not taken the final yet but expect it will be the same. However, the grading structure is such that you can get a 50% on the midterm and final, yet still get an A or B in the class if you do excellent on the programming projects.",
            "updated": 1471977534000,
            "workload": 12
        },
        {
            "id": "-KERaAs6LafwE4prkbQk",
            "author": "e522825c-ab47-4a30-92a8-f5d78f8654d4",
            "course": "CS-7641",
            "created": 1459694911000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2015-1",
            "text": "Very challenging class but incredibly rewarding. One of my favourite classes ever, you will be exposed to roughly a dozen machine learning algorithms. \n\nThe first half of the class is the most difficult. Understanding the math, ideas, requirements for papers and midterm can be a little discouraging. The second half proved to be much easier and even more interesting. I was ready to drop the class at the midpoint but ended up finishing with a top mark. \n\nAt the start of the course you have choose 2 datasets which is the basis of all your work and papers. The problem is that course does not explain what qualifies as a good dataset to study. Its a tradeoff between the training time, sample size and the number of dimensions. To little data and there is no difference between the various algorithms. Too much data and it will take a long time to run your programs. My first dataset was too simple and the second didn't have enough data to train - given the number of inputs (dimensions). I would seek clarification before finalizing the dataset choice as the idea is to compare all the algorithms on the same dataset. \n\nThe instructors are highly entertaining and seasoned experts in their field.",
            "updated": 1506799227000,
            "workload": 25
        },
        {
            "id": "-KERb7Y93IC19QY2jPwg",
            "author": "e522825c-ab47-4a30-92a8-f5d78f8654d4",
            "course": "CS-7646",
            "created": 1459695159000,
            "difficulty": 2,
            "rating": 5,
            "semester": "2015-3",
            "text": "I was looking forward to this class immensely, haven taken the previous version on Coursera. Its an extremely interesting class in finance and machine learning. You will learn the basics by which to model and test theories for trading. Its a well done course and assignments are quite structured. The instructor is awesome. \n\nI wish the class was harder and covered more material. Its a great intro, but a follow up classes would be even better. \n\nI would liked to see more on how to implement systems at scale, quantifying different signals, methods on how to automate trading with API's, etc. \n\nHighly recommend.",
            "updated": 1506799220000,
            "workload": 10
        },
        {
            "id": "-KERcWzr8pRsQ7IAk_MG",
            "author": "e522825c-ab47-4a30-92a8-f5d78f8654d4",
            "course": "CS-8803-001",
            "created": 1459695526000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2015-1",
            "text": "A great class if you want to learn how to build a self driving car from a software point of view. Taught by arguably the worlds foremost expert. \n\nThe class is actually quite easy and a great first class for OMSCS. What I learned most from the class is how statistical mathematics is applied to robotics and algorithms. It was very interesting how robots deal with noise and uncertainty. \n\nOne part of the course covers how robots can make optimal decisions given a state. The idea and some (but not all) of the terminology maps nicely to Machine Learning, Reinforcement Learning and MDPs. \n\nOverall the class is extremely well done and polished. Highly recommend.",
            "updated": 1506799215000,
            "workload": 5
        },
        {
            "id": "-KERgDjUpJzWJU-sG9f0",
            "author": "e522825c-ab47-4a30-92a8-f5d78f8654d4",
            "course": "CS-7637",
            "created": 1459696495000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2015-3",
            "text": "The course is quite interesting - it approaches AI from the point of view of minimal training data. It covers a number of approaches on how to create AI knowledge, largely from rule based systems. \n\nI enjoyed the course and received accolades for my work. The course is extremely well organized, enjoyable and fun. \n\nHowever, I think the course is a little heavy on the paper writing side. \n\nThe project doesn't map entirely well to the material taught, especially in the second half. I really enjoyed the challenge of the project, which is done in 3 phases. \n\nI would recommend this class, its a great contrast to machine learning.",
            "updated": 1506799207000,
            "workload": 25
        },
        {
            "id": "-KESI9qIkV_LGCm89K7p",
            "author": "google:115182864042713413702",
            "course": "CS-7637",
            "created": 1459706706000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2016-1",
            "text": "This has been a very rewarding class, and I highly recommend it. I agree with other posters that the time commitment varies quite a bit with ~25 hours on project weeks and 5-10 hours on weeks with papers due. \n\nAlthough you don't need any advanced image processing techniques, it would definitely help if you are already familiar with NumPy/Python and what you can achieve with it. I think taking CV and CP last semester really helped me. \n\nThe Piazza forum is very active, and there is constantly a good sharing of ideas and approaches. Make sure you make good use of this resource. \n\n I paired this class with ML4T, and that has turned out very manageable. KBAI is very front-loaded if you take the visual only approach immediately in the projects, and ML4T is very back-loaded so I've been able to mostly focus on one class or the other without many conflicts.",
            "updated": 1471735778000,
            "workload": 20
        },
        {
            "id": "-KEVY07Q4Fj5j6zEH2xx",
            "author": "52542fc2-b82b-48b0-899e-9c5b5afa502b",
            "course": "CS-6505",
            "created": 1459761189000,
            "difficulty": 5,
            "rating": 3,
            "semester": "2016-1",
            "text": "First, treat this as a 6-credit course because it's gonna take twice as much time as the average OMSCS course (some exception like ML and HPCA)\n\nSecond, unless you are super disciplined, it is not easy to prepare in advance. If you think you can, get the book \"theory of computation\" by sipser and read and re-read chapter 1-5, 7, 10 and make sure you can do the exercises at the end of each chapter. If you can do this on your own, then you won't have any surprise going into the class. \n\nThird, there isn't much hand holding from the instructors / TAs, they all have full time jobs and only instructing the class part time. Do not have high expectation coming in to the class, there is no spoon feeding. You are pretty much on your own with your fellow classmates and you should form offline/online study groups asap. Try to proactively organize discussion on piazza about the problem set and collaborate with your classmate and attack them as soon as possible. You might (policy can change) see those questions reappearing in the exams. \n\nA tip about getting most out of your study group, be very WELL prepared. Do not expect to discuss and learn on the fly, you'll fall behind and/or not understanding what is being discussed. Read all the material and understand the question in advance. \n\nPart 1 is the warmup of the course, if you're rusty with writing proof, here's your chance to practice, this is the least difficult part of the course, which will still kick your butt. \n\nLanguages & Countability\nTuring Machines\nChurch-Turing Thesis\nUniversality\nUndecidability\n\nPart 2 of the course starts with P and NP and ends with Approximation & Randomized Algorithms (they are harder to prove). \n\nP and NP\nNP - Completeness\nNPC Problems\nApproximation Algorithms\nRandomized Algorithms\n\nPart 3 of the course will kick your butt. Some people struggle with DP while others LP. \n\nDynamic Programming\nMaximum Flow\nBP Matching\nLinear Programming\nDuality\n\nExpect to work hard and spend a lot of time studying. ",
            "updated": 1462843919000,
            "workload": 30
        },
        {
            "id": "-KEW_csdbzlJMsGSht_b",
            "author": "ca09e6b2-4626-4aaf-bc18-6bd333c68ef9",
            "course": "CS-7642",
            "created": 1459778653000,
            "difficulty": 2,
            "rating": 5,
            "semester": "2015-3",
            "text": "This was a great class - the return of pair lecturing with Smoov & Curly, an interesting subject, and a far lower workload than ML (as advertised). The big thing to keep in mind is that there is an easy way and a hard way to complete the assignments. If you find yourself spending more than a few hours on a problem, you're doing it the hard way. Go back to the lectures & the assigned readings, and think about how you would solve the problem without any RL tools.",
            "updated": 1481434499000,
            "workload": 8
        },
        {
            "id": "-KEWb8J-TEuYV7qmaapI",
            "author": "ca09e6b2-4626-4aaf-bc18-6bd333c68ef9",
            "course": "CS-6475",
            "created": 1459779048000,
            "difficulty": 1,
            "rating": 4,
            "semester": "2016-1",
            "text": "This is an exemplary model for producing a very easy class. Where a bad easy class, like CS6250, has trivial assignments and artificial difficulty in the seemingly intentionally obfuscated quizzes, this class doesn't try to make things more difficult than they need to be. The assignments are released in bulk early in the semester, so it is possible to work ahead; the content is accessible, and meeting the minimum requirements of the assignments is generally very straightforward (if you know Python and Numpy); the lectures are good - although there is a great deal of overlap with CS6476 (not exactly a bad thing). The nice part about this class is that while the assignments are very easy, that has given me a lot of time to spend with the assigned reading materials (compared to, say KBAI where I completely ignored the reading material in order to tackle all the graded exercises). Overall, this is an excellent class for a light summer term, or to pair with a more difficult class like ML or CCA.",
            "updated": 1481434508000,
            "workload": 3
        },
        {
            "id": "-KEWdOyJI72edJWXrjfQ",
            "author": "ca09e6b2-4626-4aaf-bc18-6bd333c68ef9",
            "course": "CS-6476",
            "created": 1459779641000,
            "difficulty": 2,
            "rating": 5,
            "semester": "2015-1",
            "text": "This was an excellent course. I particularly liked the lectures, which were very entertaining in addition to the great content. The course page recommends a strong understanding of Linear Algebra, and that isn't a joke. The assignments are far easier if you have a solid understanding of the underlying math, and can translate that into efficient code. A good understanding of Python and Numpy will definitely help, but it is possible to pick up along the way. However, the assignments that would tend to benefit most from advanced knowledge of Numpy tricks are earlier in the semester.",
            "updated": 1481434515000,
            "workload": 8
        },
        {
            "id": "-KEWh9Vj8z68GTxFmmVu",
            "author": "ca09e6b2-4626-4aaf-bc18-6bd333c68ef9",
            "course": "CS-7637",
            "created": 1459780626000,
            "difficulty": 3,
            "rating": 2,
            "semester": "2015-1",
            "text": "I feel like a pariah, because I wasn't very impressed with this course. I appreciate the work that went into making it and the support from staff is unparalleled in the program, but the lectures didn't go into any kind of detail, and there wasn't any real discussion on the performance of the topics presented. Overall, I left the class without any confidence that I could actually apply anything outside of the class. The written assignments were worthless because the feedback was trivial, the readings were overwhelming, and the project was neat but ultimately felt pointless because the code was basically a one-off script that wouldn't have much value to any other problem domain. In the end it was demoralizing because I was surrounded by folks who absolutely loved the class, and I just couldn't drink the kool-aid. It's not a bad choice as an elective class, but I can't promise you'll really learn anything.",
            "updated": 1481434521000,
            "workload": 15
        },
        {
            "id": "-KEavC_zCoTLkcjbF7C6",
            "author": "google:101531499641196700998",
            "course": "CS-6200",
            "created": 1459868198000,
            "difficulty": 3,
            "rating": 5,
            "semester": "2016-1",
            "text": "This is a great class. The target student is someone who has an OS course as an undergrad, but a while ago (or someone who wasn't CS undergrad). You will learn new things, even if you've developed low-level code before. The projects are moderately challenging. You need to be comfortable coding in C, the language of Operating Systems. People who don't know C find the projects incredibly hard. \nThe Professor and TA's are very active on Piazza, and go the extra mile to help out students who are stuck. ",
            "updated": 1466217779000,
            "workload": 15
        },
        {
            "id": "-KEaxSqeefvVwwEf_PMp",
            "author": "google:101531499641196700998",
            "course": "CS-6250",
            "created": 1459868789000,
            "difficulty": 2,
            "rating": 3,
            "semester": "2016-1",
            "text": "An interesting course that takes you behind the scenes of the networks that we use all day every day. It's a bit less practical than I thought it would be, but also deeper into the design decisions and choices that were made in the development of the Internet. The exercises are pretty straightforward, and so far follow two patterns: a step-by-step project using a network simulator were you are finding/learning stuff, or short coding exercises (in Python) to write some of the algorithms that run on routers/controllers. You don't have to be a real Pythonista, as you can pick it up along the way. The TA's are active on Piazza, and the course seems to be a well-run machine at this point -- no weird project surprises. The recorded lectures are a bit disjoint on occasion and not as clever/elaborate as some of the more recent courses, but they get the job done.",
            "updated": 1480383752000,
            "workload": 8
        },
        {
            "id": "-KEcln-IFqiy5bHGgAhI",
            "author": "google:115398662116989618541",
            "course": "CS-8803-001",
            "created": 1459899281000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2016-1",
            "text": "24% Problem Sets (6)\n36% Runaway Robot Project\n40% Final Project\n\nProblem sets and the runaway robot project are auto-graded in Udacity. You are done once the auto-grader passes. \n\nFinal project, optionally in a group, requires studying a robot's motion over 60 seconds (1800 frames) in a box with a candle in the center followed by predicting its motion for 2 seconds (60 frames) as accurately as possible. \n\nThe lecture videos are excellent. Some of the problem sets are very challenging, but all in all, not too bad. The best part is you can work on the problem sets and RR project on your own time. I was able to finish them in the first month of class and focus on my other courses for the next two months until the final project.",
            "updated": 1471419466000,
            "workload": 10
        },
        {
            "id": "-KEhGecQw-WQVrRtlBRD",
            "author": "github:811954",
            "course": "CS-6300",
            "created": 1459974744000,
            "difficulty": 2,
            "rating": 3,
            "semester": "2016-1",
            "text": "SDP is an extremely well run course. Alex the lecturer, and the instructors are all very responsive on Piazza. Alex also has office hours every week where you can ask more questions if you have them. The course material is well laid out, the assignments are easy to understand what is required, and the lectures are well done. \n\nNow for the not so good:\n\n* This course is easy. I have only a sliver of a Java background, and this was enough to get through the paper just fine. \n* This course covers things like using an IDE and git. If you're a working programmer like myself, you will probably already know this. \n* The grading on the group assignments is focused on the paperwork you produce, not the code. We turned in an assignment that failed half the instructor tests and still got an 80 or 85. \n* There is a significant amount of group work in this paper. I was in a different time zone to my colleagues and ended up doing 6am meetings most of the time. \n* I didn't really enjoy the material. The course is about the software development process, not coding, and it covers a lot of tools that aren't relevant to me as a working programmer, e. g. UML, Rational Unified Process, e. t. c. However this is the point of the course so I shouldn't be too surprised :)\n\nOverall, this is a good paper to take if you're new to OMSCS and want an easier paper to start with, to learn the ropes of taking papers. If you've already met your foundational requirement, and aren't interested in more enterprisey processes, and are looking for challenging papers, then I wouldn't recommend this one. However I must emphasise again, how well Alex and the TA's run this course. ",
            "updated": 1459974923000,
            "workload": 8
        },
        {
            "id": "-KEmBBLsA4S4y7rIVCCO",
            "author": "598f85d2-bc4a-43b8-b9b7-052b49af41e3",
            "course": "CSE-6220",
            "created": 1460057195000,
            "difficulty": 5,
            "rating": 4,
            "semester": "2016-1",
            "text": "This class is really hard for a first class. If it has been a while since you were in a hard class you might want to wait till you have some other graduate courses under your belt. Labs where _VERY_ time consuming and took me over 50+ hours to complete. One lab took me over 130 hours to complete. \n\nSome things to keep in mind:\n1) If you are not proficient at C don't take this class\n2) If you don't know how to use GDB or Valgrind don't take this class\n3) If you don't have massive amounts of time to spare,.... you guessed it, don't take this class\n4) If you want to learn a lot and can satisfy the first 3 parts _DO_ take this course!",
            "updated": 1460057227000,
            "workload": 50
        },
        {
            "id": "-KEqs70P5SNE--usmdOv",
            "author": "google:101641942938017424398",
            "course": "CS-6505",
            "created": 1460135821000,
            "difficulty": 5,
            "rating": 1,
            "semester": "2016-1",
            "text": "I am not a formal math person, and if you aren't either, then this is going to be rough",
            "updated": 1460212440000,
            "workload": 20
        },
        {
            "id": "-KErjCvsW7r8gdG4_ypq",
            "author": "5fa1d897-71d1-4c9c-a0d2-426385bf9f15",
            "course": "CS-6250",
            "created": 1460150249000,
            "difficulty": 2,
            "rating": 5,
            "semester": "2016-1",
            "text": "I have been working in the networking industry since 2002 developing networking applications and protocol stacks. In spite of the experience, I learned loads from this class - especially on the L3 side. The projects are fun, and shouldn't be a problem if you know Python (an absolute must for this class). The TAs and Prof. are super active in Piazza and Office Hours are also conducted twice in a week. \n\nThis course requires reading of published papers apart from video lectures (which I found not rich in details - might be a problem for students not exposed to networking concepts earlier from school / work). There are 2 closed-book proctored tests involving a plethora of multiple choice, descriptive-types, and problem-types questions. It is important to internalize the concepts mentioned in the papers and video lectures if you want to do well in the tests. ",
            "updated": 1460150249000,
            "workload": 7
        },
        {
            "id": "-KF1BhlvuXXsI0iiA0h5",
            "author": "7a2acc4a-ac14-46fd-8252-0013fb02cb79",
            "course": "CS-6400",
            "created": 1460325780000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2016-1",
            "text": "This review comes after the third of four exams, and near the end of the final project. \n\nDr. Mark is straightforward and to-the-point in lectures. The textbook is readable. If you try taking the exams without having read the book, you will have a bad time. \n\nAs mentioned in other reviews, this course is mostly review for experienced database developers. This course is deceptively easy. The material and concepts are not hard to grasp, but the exams have some subtle questions that might combine three or four little tidbits into one question. That's probably why the average exam scores have been in the 80's. \n\nFor this semester, there are three group projects. You're given a spec document, and must design and implement a database-backed application to satisfy the spec. The last of the three projects is implementation, and it feels like busywork. \n\nOverall, kudos to Dr. Mark and the TA's. This course was interesting, well-run, and not too difficult. ",
            "updated": 1460325780000,
            "workload": 4
        },
        {
            "id": "-KFAEdN3Soj_0ruA1s4d",
            "author": "google:112562038522702585883",
            "course": "CS-7646",
            "created": 1460477531000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2016-1",
            "text": "A really great class on its own, but Professor Balch's constant presence in Piazza makes it a game changer. He and the TAs are insanely responsive and always have a nice mix of hints & wit in their replies. \n\nThe assignments start off pretty simple and ramp up near the end. The third section can be challenging but very satisfying to see things working. The lectures are really wonderful, and the textbooks are also fantastic, which is something I rarely say. \n\nMy sole complaint is a big one: the mid-term. Essentially the class compiles a list of questions for the mid-term, which culminates into a 700-question bucket. Those who did well largely memorized as much of this as possible. It seemed like a large amount of busy work and taking exams based on memorization is a pretty crummy way to spend a Sunday. \n\nSo prepare for a really great, fun course with one bummer in the middle. All in all, highly recommended. ",
            "updated": 1460477531000,
            "workload": 10
        },
        {
            "id": "-KFAG20_fh5ktqbrGg5x",
            "author": "google:112562038522702585883",
            "course": "CS-8803-001",
            "created": 1460477898000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2015-3",
            "text": "This class is different than the others I've taken in OMSCS. It's largely working in isolation as the quizzes are all in Udacity and Piazza is often a ghost town. Dr. Thrun's videos are really entertaining andinformative. The TAs are phenomenal. Probably the most engaged and verbose TAs I've encountered in the project. Ask a question and you'll get more detail than you'd have expected. \n\nI think this class just needs some way to push interacting with the rest of the class. I know a lot of people take it with another course. This makes sense due to the flexible timeline of completing projects, but it leads to people doing their work quietly and moving on. Which is a shame because this material can be dense and it's nice to be able to play ideas off of others. \n\nBut I definitely recommend it. ",
            "updated": 1460477898000,
            "workload": 10
        },
        {
            "id": "-KFAHlmQ9C5PNgIt6uS1",
            "author": "google:112562038522702585883",
            "course": "CS-6475",
            "created": 1460478352000,
            "difficulty": 2,
            "rating": 3,
            "semester": "2015-3",
            "text": "Professor and TAs are fairly active on the forums. The lectures are very interesting but some of the projects felt only partially fleshed out. I did enjoy it as a photography enthusiast but some of it felt trivial. ",
            "updated": 1460478352000,
            "workload": 10
        },
        {
            "id": "-KFtYCGzWo9DVBU2OVXi",
            "author": "9df6273c-3ac3-42a8-a73d-7732e0c1324f",
            "course": "CS-6400",
            "created": 1461254410000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2016-1",
            "text": "The course had a lot of potential, but started at too basic a level. I'd have preferred diving right into Relational Algebra and Relational Tuple Calculus, as well as covering more advanced DB topics. It seems like the first half of the course was a remedial introduction to concepts that should have been familiar to master's degree students. \n\nThe final project was a really jarring change from the rest of the class, where we had to implement a functioning webapp. This divided the class into two camps: full time developers who could do it easily, and non-programmers who struggled with the implementation. ",
            "updated": 1461254410000,
            "workload": 10
        },
        {
            "id": "-KFt_3difuXG_Gc0F3TQ",
            "author": "9df6273c-3ac3-42a8-a73d-7732e0c1324f",
            "course": "CS-6340",
            "created": 1461254899000,
            "difficulty": 4,
            "rating": 4,
            "semester": "2016-1",
            "text": "This was a fairly interesting class, with a few serious flaws. The teaching style of the professor was somewhat detached and aloof. He rarely showed up in Piazza, and left things mainly to students. The head TA was active, but his style was also a problem, usually answering questions with more complicated responses that did little to address the fundamental problems that students were having. \n\nThe assignments were written in a very dense academic style that made for a lot of confusion in the students. \n\nThe assignments were very challenging, with the mean scores on the low side. The assignments often required considerable outside research. In some cases we were referred to external resources and documentation that didn't match the stuff provided with the assignments. \n\nThe first assignment was on a tool called Dafny, and it wasn't covered in class at all. We were given the assignment with a brief overview, referred to the Dafny website, and left to puzzle it out on our own with virtually no instructor or TA guidance. \n\nThe midterm was very challenging, and didn't have enough time allocated for it. \n\nIn spite of all of this, the material was genuinely interesting. This could be a fantastic course if the problems were addressed. ",
            "updated": 1461254899000,
            "workload": 15
        },
        {
            "id": "-KFu6XYm065mUrgsXEZF",
            "author": "d8f260f7-8284-4582-8f02-0e4e27ad9c99",
            "course": "CS-7637",
            "created": 1461263935000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "This course, even after adjustment, has a heavy workload of both writing (a surprising amount of that, actually) and coding. As someone without a formal CS background, I found the coding extremely challenging, especially because the push is always to be perfect - and in this course, that's very difficult to do. That said, my Pythonic prowess is significantly higher after having taken this course, and I was incredibly proud of the progress I made both in knowledge of course material and coding over the duration of the term. This class was wonderful; the lecture material and written assignments dovetailed perfectly, the core concepts were really interesting, and the instructor/TAs were very engaged. I do highly recommend learning some basic image processing (even how to use Pillow functions would help) before coming into the class. This was an incredibly well-structured class, and I enjoyed it tremendously, despite all the hard work. ",
            "updated": 1461264059000,
            "workload": 20
        },
        {
            "id": "-KG02CNQvV33XMerBRbF",
            "author": "52499187-014b-47bd-857c-73b61c27473b",
            "course": "CS-6250",
            "created": 1461380239000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2016-1",
            "text": "Scientific research papers are a bit long and numerous(not sure there is a cost-benefit there... maybe considering requiring PARTS not ALL for each paper). The videos are pretty straight forward, and you have to know videos and papers for the TESTS. We only had 2 tests, but were supposed to have many----next semester I think they will do more. The projects were cool and interesting(know your Python), once you figured out how to get started. That might be my one recommendation is that sometimes we really had no idea how to get started. They definitely expect the \"figuring it out\" part is the first step of each project and is crucial to understanding. The autograders were a bit scary, cause even when you got the project working, you were worried whether your project would pass or not. Our last project has an autograder we had access to, so we knew for sure. Hopefully that will become the norm. My advice, the projects are very doable if you start early. Those who waited really seemed to panic at the end. TA (esp Michael) were extremely communicative in Piazza, so use that site daily for questions and updated. The course looks like they are redesigning, so there is definitely some re-ordering that needs to be done between readings, quizzes, and projects. But, overall good course with appropriate level of time commitment. ",
            "updated": 1461510255000,
            "workload": 8
        },
        {
            "id": "-KG17y2aucWIhTdcOIrL",
            "author": "c92fab32-20e0-48d2-9408-0850a20ed6c5",
            "course": "CS-6601",
            "created": 1461398489000,
            "difficulty": 4,
            "rating": 5,
            "semester": "2016-1",
            "text": "This course requires a lot of commitment, the assignments require additional investigation and strong knowledge of Python plus Numpy and Scipy. \n\nPersonally I did not know a lot of Numpy starting the course and was forced to learned as the course progressed, had I known it beforehand the assignments would have been less complicated. \n\nThis is my first course on the program so I cannot compare with other courses in the program, but I had to dedicate a lot of time to this one. \n\nDefinitely get the recommended book... either buy it (you will not regret it as it is a great book) or get the online version. There is a lot of reading based on the book. \n\nThere had been a few bugs in videos and assignments, which I expect to be fixed in the next iterations of the course. \n\nEven with this small issues I have really enjoyed this course.",
            "updated": 1483108722000,
            "workload": 30
        },
        {
            "id": "-KG1jI--ZIRB-o4qBeyx",
            "author": "a8ab8447-ef03-4bef-9c6d-5b8c74d133ae",
            "course": "CS-6250",
            "created": 1461408577000,
            "difficulty": 2,
            "rating": 1,
            "semester": "2016-1",
            "text": "I want to start off by saying that the Instructors for this course were top notch. They were quick with grades and responding to questions on Piazza and were very helpful. My review below is not a reflection of the Instructors, but solely the content and assignments for the course. \n\nI was quite disappointed in this course. The projects were simple and typically didn't require much effort assuming basic Python knowledge; Less than 2 hours each. I would've expected the projects to be more challenging considering my undergraduate Computer Networks class involved implementing a subset of functionality for an FTP server in C, given only the RFC document. The exams, of which there were 2, were typical memorize and regurgitate style with multiple choice and free response questions through ProctorTrack. \n\nThe content did not fit what I expected from a Computer Networks class. It seemed to be a hodge podge of select topics in the computer networking realm. I honestly didn't get much out of the class. \n\nIf you want an easy class and are ok with the typical memorize and regurgitate style of exams, then this is the class for you. ",
            "updated": 1461408577000,
            "workload": 1
        },
        {
            "id": "-KG5G_w6jb3LHKoKYRUk",
            "author": "google:117284154269435309426",
            "course": "CS-6250",
            "created": 1461467897000,
            "difficulty": 2,
            "rating": 3,
            "semester": "2016-1",
            "text": "The instructors were great, the TAs were great. Quick to respond to issues and were very active on Piazza. The 6 projects were pretty straight forward and didn't need more than a few hours each to complete. The language of choice is python. I didn't know python going in, and it was easy to pick up, so don't worry if you don't know it before hand. The course seems to have changed format from before. Now there are 2 exams, roughly corresponding with midterm and final. There is probably about 7-10 academic papers to read. The video lectures are from the old format, and don't match up well with the projects or papers. The video lectures also tend not to explain things well or thoroughly. I found myself on multiple occasions going to wikipedia to look up topics in order to understand them better. Fairly easy class. ",
            "updated": 1461467897000,
            "workload": 3
        },
        {
            "id": "-KG5NU_pg1zZA8dmHkPZ",
            "author": "google:114627687220757492896",
            "course": "CS-6035",
            "created": 1461469704000,
            "difficulty": 1,
            "rating": 5,
            "semester": "2016-1",
            "text": "Great class. I would definitely recommend taking it with another class, especially if you have a hard class you need to take because the class is not difficult. \nThe first half of the semester is basically common sense stuff, really if you know little about security, you know enough for the first half. The second half of the class, which I consider to start with cryptography, is a little more challenging, but it is not difficult to grasp the concepts. \n\nMy favorite part was the projects - 4 projects + 4 optional, of the optional you only can do 1. \nProject 1 - Easy, work with C and gdb\nProject 2 - Easy, triggering malware\nProject 3 - Easy, basically doing a test for an app that one of the TA's built - Very bad project in my opinion because I didn't learn anything and really did not get anything out of it. \nProject 4 - Easy, you \"hack\" a fake website. \nNot as easy as the other 3, but if you know JS and HTML you will be fine. It took me a bit more time than the others simply because I was confused as to what I was doing. \n\nMidterm was not difficult, all true/false and multiple choice questions. You can only answer them one at a time, so that was annoying because you could not go back and double check. The questions were similar to the Quizzes, but some of the questions did get me. \n\nI should mention this is my first class in the program and I would definitely recommend it to anyone who is new and thinking about taking it. ",
            "updated": 1461469816000,
            "workload": 6
        },
        {
            "id": "-KG7lo4uhGGmRZKsdFid",
            "author": "1538f1ce-0733-4351-82fd-66e71a37640e",
            "course": "CS-7637",
            "created": 1461509897000,
            "difficulty": 3,
            "rating": 5,
            "semester": "2015-2",
            "text": "This was easily one of the best courses I've ever taken! The concepts in the lectures are explained very well, the time requirement for the lectures isn't insane, and David Joyner and the TAs were extremely helpful. The writing assignments are thought provoking and not at all overwhelming. The Ravens Matrices project is definitely hard, but you have all semester to work on it, and after you get the basics of it set up it's actually a lot of fun. I think this was the most enjoyable course so far. ",
            "updated": 1461509897000,
            "workload": 12
        },
        {
            "id": "-KG7wjkHZKBIYoFaTOz6",
            "author": "1538f1ce-0733-4351-82fd-66e71a37640e",
            "course": "CS-6250",
            "created": 1461512763000,
            "difficulty": 4,
            "rating": 1,
            "semester": "2015-3",
            "text": "I had an extremely difficult time in this course. The lectures were actually pretty good throughout the first half of the course but became more technical and less well explained during the second. The projects were not difficult, but I don't feel that they added anything to my understanding of the concepts. \n\nThe major problem I had with this course was the quizzes. The multiple choice questions were loaded with ambiguous answers, which still seemed ambiguous after watching the lectures multiple times and scouring Google for information. It often felt like you were left with 2 or 3 equally plausible choices and then forced to make a guess. There were multiple times where I felt like I actually, thoroughly understood what the question was asking and how each of the answers worked, but still had to just guess which was the \"best\" answer. \n\nThe free response questions weren't as tricky, but only gave you 90-120 words to explain your solution. There were 2 times in the beginning where I was penalized for not including all the information - I knew the information that I had left out, I tried to imply it in the response as much as possible, but didn't know how to get it all in there given the short answer length. I felt like I was being penalized not because of my understanding, but because of some weird artificial limitation. After this, rather than trying to explain my solution, I wrote down shorter jargon filled answers that, truthfully, I sometimes didn't fully understand and ended up getting full credit. This to me seems like a flaw - it felt to me that the grade was less about understanding and more about memorization. \n\nThis may be a harsh review, but I really didn't like this class. ",
            "updated": 1461512941000,
            "workload": 12
        },
        {
            "id": "-KG8Hxo7zSK8W1nxBfmO",
            "author": "7dedf9a0-7ed8-4d3f-a531-5fd2cda6bb20",
            "course": "CSE-6250",
            "created": 1461518589000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "Do you want a challenge? Do you want to use all the big data software we hear so much about (e. g. hadoop, spark)? Do you also want less sleep? :)\n\nIf you answered yes to all of those questions, then take this class. The class was incredibly interesting, with lots of work and investigation required by the student. The lectures are really light on material, as the professor says, it is expected that the student goes out and learns and experiments on their own. \n\nI would highly suggest being familiar with Python, some Scala, and Machine Learning concepts BEFORE taking this course. I really did love the course, it was incredibly challenging, but very rewarding at the end. \n\nThe professor does need to get things a bit more organized in terms of expectations of deliverables, but given this was the first semester and the professor seems to react well to lots of questions and a bit of criticism, I am certain it will improve. ",
            "updated": 1461518589000,
            "workload": 35
        },
        {
            "id": "-KG8WrSg43sxz9B31xeP",
            "author": "github:188194",
            "course": "CSE-6220",
            "created": 1461522584000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "This class is definitely one of the best classes I've taken (both in this program and overall). \n\nThe class is very rewarding, and Prof. Vuduc's way of explaining/presenting things is just awesome. However, be aware of:\n- Assignments: they are really hard and require time\n- You need to know both C and C++ (one of the assignments is in C++, and it is not a trivial program to code)\n- Exams are really hard, and there only a few people getting 90%+ on them\n\nAll that being said, don't get discouraged, as this is a very good course, and your grade most probably will be quite good. ",
            "updated": 1461522584000,
            "workload": 15
        },
        {
            "id": "-KG8bxxsL0_W4XpEze1W",
            "author": "1538f1ce-0733-4351-82fd-66e71a37640e",
            "course": "CS-6476",
            "created": 1461524094000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "This course is both extremely challenging and extremely rewarding. The projects are very hard, but every one of them was something I've always wanted to know how to do - actually getting them implemented and learning how it all works is just incredible. The lectures cover an extremely wide range of topics, while there is sometimes more of an emphasis on the math than the intuition, you come away with a lot. \n\nThe projects you work on in this course are some of the coolest things I've ever worked on. If they offered another CV course with more projects like this, I would take it in a heartbeat. Seeing the output of an algorithm that you implemented to track a hand in a video for example, that's just awesome. \n\nThe time requirement is very real. The 2nd project, which turned about to be the longest, took me about 60 hours to complete. The math and linear algebra can be intimidating, and if it wasn't for the community on Piazza I don't think I would have figured out how to do certain things. As difficult as it is, the grading is very honest and the TAs are extremely helpful - if you put in the effort you will succeed. \n\nThis is a very challenging course but it is 100% worth it. I would HIGHLY recommend learning numpy and at least brushing up on opencv basics before taking this course. I think a better understanding of numpy and \"vectorization\" in particular would have saved me a ton of headache in the first half of the course. Also, I did not do this, but I wish I had taken Computational Photography first. There were a few posts on Piazza about how much that helped. ",
            "updated": 1461524367000,
            "workload": 25
        },
        {
            "id": "-KGMHPLsJ91c4DJA6YHb",
            "author": "cdda890f-4d30-4412-829b-294211cfa575",
            "course": "CS-6310",
            "created": 1461753325000,
            "difficulty": 4,
            "rating": 2,
            "semester": "2016-1",
            "text": "This course is very strange, and I was very disappointed from its offering and content. \n\ndownside:\nOther then that, this is a total waste of time. The lectures are super boring and outdated (too much in high level) and not relevant for 2016 - you we feel like you are 15 years back in time - This is a shame. \nThe assignment are very general and will not provide you any added value. \nThe course is not being organize and it feel like lectures, projects and assignments that have nothing to do to each other, and 80% of the content will need help you in your career. \n\nupside:\nYou can learn a lot from the projects, but I do not think that they were managed and specified poorly. \n\nBe prepare for lot's of hours being spent on the projects. ",
            "updated": 1461999850000,
            "workload": 20
        },
        {
            "id": "-KGP1cFpSGGiIiWyhSnY",
            "author": "github:8923656",
            "course": "CS-6250",
            "created": 1461799522000,
            "difficulty": 2,
            "rating": 3,
            "semester": "2016-1",
            "text": "Great instructor and TAs. Piazza was pretty active, and the teaching staff was quick to respond to most questions. This semester, we had 2 tests @ 20% each, and 6 projects at 10% each. The projects were all pretty simple, with Python as the required language. Having basic Python knowledge is recommended. Also, the staff released problem sets before the tests that prepared you pretty well for the material. To keep on schedule, we typically had to read one paper a week and watch one 30-minute lecture. ",
            "updated": 1461799522000,
            "workload": 3
        },
        {
            "id": "-KGP4SU8OKskRjSJ72wi",
            "author": "github:8923656",
            "course": "CS-7641",
            "created": 1461800264000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "This was one of the hardest classes I've ever taken. Even to gain a cursory understanding of the material required many hours of reading supplementary material along with watching the video lectures. The projects were also fairly difficult and usually took anywhere from 30 to 50 hours to complete. You're allowed to use any language you want, which is nice, but make sure you find data that you're actually interested in analyzing! That will go a long way in keeping you interested and motivated in the class. \n\nThe TAs and Dr. Isbell were great on Piazza, and I felt were fair in grading. The class is very difficult, and is graded harshly, but there is a curve at the end, so don't lose hope if you feel you aren't doing well! Despite its difficulty, I found the lectures and the material to be very engaging. Topics were explained very well, and were supplemented by the readings. I very much enjoyed this class!\n\nI took this class along with Computer Networking. Overall, it was a good balance, as Networking was pretty easy, and this class was pretty difficult. ",
            "updated": 1461800264000,
            "workload": 20
        },
        {
            "id": "-KGSCFrnMvrAr2Cp0ZWr",
            "author": "google:105105106243792378513",
            "course": "CS-6300",
            "created": 1461852638000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2016-1",
            "text": "This course was very simple. It introduces you to the basics of Software Development and provides some tools that you would use on a daily basis. Many of the projects and assignments were very simple and took around 3-4 hours per week to finish. The TAs and Professors were very good and helpful. \n\nOverall, an easy first class but none of the material will be new to someone who has worked in the field for a few years. ",
            "updated": 1461852638000,
            "workload": 4
        },
        {
            "id": "-KGSO5mZTaIfy6sEAqwn",
            "author": "google:117773455411413753598",
            "course": "CS-6210",
            "created": 1461855743000,
            "difficulty": 4,
            "rating": 2,
            "semester": "2016-1",
            "text": "I am writing this review after dropping right before the due date of the first project, roughly a month into the class. Mainly had to drop because a newborn and toddler in the house made it almost impossible to get any work done. \n\nThat said, this class had a lot of required reading. Not the most interesting material to read through but it is scientific papers so be prepared to read papers several times. I think on average there were 3-4 papers per week. The first project seemed reasonable but a lot like the projects in IOS (which I took Fall 2015 and did very well in). You will fight with the autograder a lot and instructions were fairly vague. Good help from Piazza though. \n\nFrom looking ahead before I dropped there is A LOT of material you are tested on in the midterm/final study guides that comes directly from the papers. This might be the reason that the test grades are so low. \n\nI was excited to take the course but after spending just over a month in the course I'm glad I dropped it. Definitely information overload from the papers and trying to digest those left me exhausted when tackling the project. If the instructor trimmed down the readings a bit so you could focus on the lecture material and projects (where you actually learn IMHO) then this could be a good class. Until then I will not be signing up again. ",
            "updated": 1461855743000,
            "workload": 25
        },
        {
            "id": "-KGSjDTDpU53O-fyllJj",
            "author": "88bcac89-da06-4b05-84d9-5e1b41954072",
            "course": "CS-6300",
            "created": 1461861541000,
            "difficulty": 2,
            "rating": 4,
            "semester": "2016-1",
            "text": "Overall, this was an enjoyable course. The content is a good intro for someone like me with no professional CS experience. Most of the assignments were fun, interesting, and not overwhelmingly challenging. I wasn't crazy about the group projects because there's always a roll of the dice with the quality of your teammates, but it mostly worked out ok. \n\nThere is one major problem with the class, though: they were extremely ineffective and providing timely feedback for assignments. We had weekly assignments and in many cases it was over a month between submission and when the grades were released. This made the assignments quite a bit less effective than they could have been. Every week the head TA made commitments about when we'd get our next wave of grades back and he virtually never followed through on those commitments. Were it not for this significant shortcoming, I'd say the class was outstanding. ",
            "updated": 1461861541000,
            "workload": 8
        },
        {
            "id": "-KGT8PK18oOAS_nh7xyb",
            "author": "c736935d-9f75-446a-9dcd-2b883eb302a3",
            "course": "CS-7642",
            "created": 1461868406000,
            "difficulty": 3,
            "rating": 4,
            "semester": "2016-1",
            "text": "This is a great course with a lot of good theory, but is still very abstract. A few more practical projects/HW could be beneficial for the course. It's language agnostic, which is great (Java and Python most common - but beware of buggy RL packages!). Some assignments can even be done with pen & paper - it's pure math and probability. \n\nThe two course projects were the places where you actually learn a ton! You read academic papers thoroughly and try to reproduce results from them. So, you're reading the cutting edge research that is being published. I wish there were more such courses. But some people may not like this overly academic scenario. It is likely that subsequent semesters will have more paper-reproduction projects and less MS-style homework assignments. \n\nFinally, this course doesn't have as much instructor involvement as ML does. But our TAs Miguel and Tim were very responsive. ",
            "updated": 1461868406000,
            "workload": 10
        },
        {
            "id": "-KGUQpcRuvJTtXUvZWre",
            "author": "google:104900997476157124270",
            "course": "CSE-6220",
            "created": 1461890001000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "One of the best course I have taken in OMSCS (having taken ML, CV and RL). \nLectures are fun, HWs are intense, exams show you what your actual understanding of the subject is. If there was a follow up to this course, I would have taken it hook line and sinker. \nTips: \n1) Know your pointers (need not be an expert though)\n2) Leave sufficient time for the projects. \n3) Don't get discouraged, if you work hard you would definitely get to the other side smarter and funnier. \n\nRecommendation:\nJust take it !!! (if you love coding, algorithms and want bragging rights !!!)",
            "updated": 1461891128000,
            "workload": 20
        },
        {
            "id": "-KGYspvJOKnu4-Q2Lboa",
            "author": "45d9d08e-d330-40ec-9b31-81a69e6fdf1f",
            "course": "CS-7637",
            "created": 1461964726000,
            "difficulty": 3,
            "rating": 5,
            "semester": "2016-1",
            "text": "This was a truly exceptional class! The professor is absolutely in love with the material and very engaging. TAs kept Piazza tidy and helpful and were reasonably available. The material is interesting by itself and the course project (which, at time of writing, occurs over three installments which build on each other) is very fun and challenging. The midterm and final exam were remarkably creative and enjoyable. The smaller writing assignments were also fun and engaging. If you want to get a lot from this class (and there's a ton to get), take it by itself or with a light class so that you can spend a lot of time delving into and working with the material. Also, don't get hung up on the word-count suggestions in the writing - just write a cohesive answer to the given question(s) and you'll be fine. \n\nIf you don't have a strong (if any) background in code, this is probably not a terrific course to start with (look into SDP as a refresher/starter course), though some classmates reported little-to-no prior experience and came out fine in the end - just be prepared to dedicate several hours outside of class to developing your software skills and get into a study group with other students who can mentor you. ",
            "updated": 1461964916000,
            "workload": 12
        },
        {
            "id": "-KGZyf4y5GxaJ6J0rsBN",
            "author": "dc2b3d03-7228-4663-80cf-4d1c5032d22f",
            "course": "CSE-6250",
            "created": 1461983032000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "There are 4 assignments and 1 final project and I wanted to quit 5 times. All of them are excruciating and there are 0 scores all the time, even during the stage of final project. \n\nCompared with Machine Learning, the workload for this one is waaaay much heavier and the assignments are way much more difficult. For ML, the assignment does not have a fixed answer, you can basically write it in any reasonable way; however, for all 4 assignment here, your scripts must generate a set of unique right answers (some of them need to be within in a certain range), if your script does not compile, you got 0 (because they were auto-graded). \nFor each homework, there are several questions. Although TAs claimed that they would grade them independently, it is highly possible that, if you can not solve the 1st one, you cannot go any further. \nThe videos on Udacity are \"useless\", you can barely learn nothing from there; but you will learn everything else via assignments, final project, labs, and student discussion posts on Piazza. \n\nThis course is about Health, but it's not healthy at all to take it - so many sleepless nights, excruciating debuging process, having no idea where to go, etc. etc. :)",
            "updated": 1461983032000,
            "workload": 40
        },
        {
            "id": "-KGaA-2pHhaOv5Nef1eJ",
            "author": "0382db7e-8d63-4513-ac6e-e4573428de8e",
            "course": "CS-7637",
            "created": 1462003040000,
            "difficulty": 1,
            "rating": 2,
            "semester": "2015-3",
            "text": "This class can be fun to tinker with, but ultimately I don't think I learned anything useful in this class. \n\nThe professor and TAs were incredible. They are very engaged, obviously passionate about the class, and ran a very smooth ship. But, this class was too much fluff for my taste. I remember when I was in undergrad, there were different versions of physics classes of varying difficulty for different majors. The easiest version was for humanity majors, which was mostly high-level and conceptual, and was dubbed \"physics for poets\". I felt this class was \"AI for poets\". But, it seems a lot of students don't share my sentiment and loved this class. I suspect those from a more math heavy background might find this class boring. \n\nThe class is pretty easy and is a good candidate to pair with a harder class. Because there is a good deal of writing, I suspsect students who don't speak English as a first language may struggle a little more with this aspect. ",
            "updated": 1462003816000,
            "workload": 5
        },
        {
            "id": "-KGbaT9Cnv0qad3wb3Ny",
            "author": "google:103248742678384713138",
            "course": "CS-6340",
            "created": 1462027003000,
            "difficulty": 5,
            "rating": 2,
            "semester": "2016-1",
            "text": "This was one of the more difficult classes I've ever taken. It's the only time I can recall ever having to just completely give up on getting an assignment to work and just turned in something I know didn't work. A majority of the assignments were not too difficult and only took a few hours. On the other hand, the ones that were harder than average seemed almost impossible to complete. The lectures were very well done and he gives you just about everything you need to know to trudge and sweat your way through the exams. (The exams were open note... but they really aren't useful except to try to confirm some basic facts you aren't 100% sure of. ) That's because most of the time on the exam will be spent trying to decipher most of the questions that seem to be written as a brain teaser than an exam question. If the exam questions were more straightforward, I would be happier with this class overall. Do not try to cheat your way through this class. He will run your code through a plagarism detection system (MOSS). I didn't cheat, but it still stressed me out a lot that there were announcements saying people who cheated should confess or be reported to the dean. I would always worry that the system might flag my submission as a false positive when it was analyzed. This is probably the second most stressful class I've taken in the program. If I knew what I was getting into with this one, I probably would have just taken something else. The topics covered were far from what I was expecting. I wish they would break this into 2 classes... One for testing and one for analysis. I don't think I gained much personal benefit from the analysis part and very little useful knowledge from the testing part... Overall, a thumbs down from me. The biggest positive right now is that I took the final yesterday and I am just so happy that is over and done!",
            "updated": 1462027003000,
            "workload": 18
        },
        {
            "id": "-KGcXExjit1FAmp8-iVq",
            "author": "google:106345892943455895240",
            "course": "CS-6505",
            "created": 1462042689000,
            "difficulty": 5,
            "rating": 1,
            "semester": "2016-1",
            "text": "I am not finished yet, but it is hard to put into words how awful an experience this class has been. I have never watched so many lectures from other schools in any course, because the gatech ones are so bad. There is little interaction between students because of the draconian plagiarism policy. No teaching. Just threats, dictates, and grades. I am riding it out mostly as an experiment and will not re-take it when I flunk. I am so glad this is not my first OMSCS class, because I would absolutely quit the program if it were. Treat this as a certification exam on your PhD level understanding of discrete math symbology and language, proofs (which many have not been bothered with since the 9th grade), and 1800 pages of at least 2 if not 5 incredibly dense textbooks. Know it up front, because you won't learn it from the class. A Computer Science class where you can't use a computer or calculator is just ironic and tragic. If you really want to learn this stuff you need to take this on-campus and choose your professor carefully. I see minimal value in the knowledge required to get an A in this class unless you are going into academia or just want to sit around with mathematicians and argue about P vs NP theory (I assure you the professional STEM world has better things to do). \n\nIt sounds like the course in Spring 2016 is MUCH different from previous semesters, so beware. In my opinion they are phoning it in now. ",
            "updated": 1462044694000,
            "workload": 40
        },
        {
            "id": "-KGcbF51bRRNFXyr-Nek",
            "author": "google:106345892943455895240",
            "course": "CS-7641",
            "created": 1462044000000,
            "difficulty": 5,
            "rating": 3,
            "semester": "2015-3",
            "text": "This class is tough. The workload is huge and the amount of material covered is enough for two or three 3 hour classes easily. It also cries out for a Lab session environment where students can work on projects somewhat communally and get feedback from TA's in real time. The topic is fascinating, and the professor(s) are impressive so it is overall a good experience. The lectures are mostly just summary level though. You have to grind through the text and supplemental reading to understand it. The class needs more structure in the projects. The open-ended character of the process of choosing data sets and software environments for the projects makes it 10x harder than it needs to be. You can easily find youself wasting all your project time on trying to make these decisions. One important note is that the curve is very kind. Fight the urge to drop the class because of results and difficulty; it is worthwhile to stick with it. They seem to enjoy making everyone think they are failing and then curving to mostly A's and B's. Hopefully you will have some benevolent genius classmates that are active on piazza as well - I know I could not have done it without them. ",
            "updated": 1462044000000,
            "workload": 20
        },
        {
            "id": "-KGdMA2zBXux3fSfFD3F",
            "author": "google:109501930207149737058",
            "course": "CSE-6250",
            "created": 1462056633000,
            "difficulty": 5,
            "rating": 5,
            "semester": "2016-1",
            "text": "This course is tough but you will learn a lot. Don't take this with any other tough course. It would be too hard to manage your time between office family and studies. But all said.. this is the course if you really want to learn the big data tools. If you dont have any ML experience or advanced statistic experience you will suffer in the beginning and you will have to work hard to get the homeworks done on time. If you are taking this course make sure you start working on assignments as soon they are released. They are not easy to work on if you start in last 4-5 days. ",
            "updated": 1462056633000,
            "workload": 35
        },
        {
            "id": "-KGd_H_ik4UGr76J7R59",
            "author": "d944ddf0-b283-4298-984a-0a56e27c358a",
            "course": "CS-6505",
            "created": 1462060263000,
            "difficulty": 5,
            "rating": 1,
            "semester": "2016-1",
            "text": "The way this class is taught does not belong in a computer science department. It is being taught as a completely theoretical math course by an instructor who is a math phd. As a computer scientist you can expect pretty much every job interview to include algorithmic questions. This class will not prepare you at all for it. You spend most of the time figuring out how to encode Turing machines or theorizing about esoteric mathematical graph properties, both of very little use for computer scientists. The instructor really didn't do much throughout the entire class. His attitude is either you already know the material and you'll pass, or if you don't he can't really teach it to you. The lectures (prepared by another instructor) don't really give you the background needed to solve the homework or the exams as set by the current instructor. You mostly have to make up your own curriculum and hope that what you studied gives you the math background needed to barely pass this class. I don't recommend taking this class until they change the current instructor or he changes the way it's taught. When half the class drops by the withdrawal date and the remaining half gets a C or lower, you're really not teaching anything and you actually didn't do your job as an instructor, in my opinion. ",
            "updated": 1462060263000,
            "workload": 30
        },
        {
            "id": "-KGhAviGwRH65bpjixa5",
            "author": "f352460a-b9e8-4655-abb2-f3e26afb017b",
            "course": "CS-6300",
            "created": 1462120725000,
            "difficulty": 2,
            "rating": 2,
            "semester": "2016-1",
            "text": "For the bad:\nThis is the easiest course I've taken thus far, and it's my fourth software engineering course (2nd at GA Tech), and I have a substantial amount of experience coding in Java which helped. However, this will probably be my lowest grade at GA Tech, because their grading rubric and assignment weights are absolutely asinine. They would deduct huge amounts of points for trivial, ridiculous, or even subjective reasons. \n\nThey would also derive requirements from posts between students, or from optional office hours (note: there was a special requirements interview office hours, and I'm not referring to that one) and then grade against those arbitrary requirements, which I found to be rather uncalled for and unbelievable. \n\nThere's a lot of group work, and every week some project or assignment will be due, so the workload is very consistent, you will be putting in hours towards this class every single week for the full semester. Take this into account if you have a lot of business trips or plan to take any additional courses while taking this one. \n\nFor the good:\nThe lecture videos are some of the best I've seen at GA Tech and the android application development was really fun, plus there were consistent office hours on google hangouts every week. ",
            "updated": 1462120780000,
            "workload": 6
        }
    ]
}